USE Manufactory;

CREATE TABLE SPJ
(
    ProviderID VARCHAR(2) REFERENCES S(ProviderID),
    ItemID VARCHAR(2) REFERENCES P(ItemID),
	ProjectID VARCHAR(3) REFERENCES J(ProjectID),
	S INT CHECK(S > 0),
	PRIMARY KEY (ProviderID, ItemID, ProjectID)
);

INSERT INTO SPJ
(ProviderID, ItemID, ProjectID, S) 
VALUES
('о1', 'д1', 'оп1', 200), 
('о1', 'д1', 'оп2', 700),
('о2', 'д3', 'оп1', 400), 
('о2', 'д2', 'оп2', 200),
('о2', 'д3', 'оп3', 200), 
('о2', 'д3', 'оп4', 500),
('о2', 'д3', 'оп5', 600), 
('о2', 'д3', 'оп6', 400),
('о2', 'д3', 'оп7', 800), 
('о2', 'д5', 'оп2', 100),
('о3', 'д3', 'оп1', 200), 
('о3', 'д4', 'оп2', 500),
('о4', 'д6', 'оп3', 300),
('о4', 'д6', 'оп7', 300),
('о5', 'д2', 'оп2', 200), 
('о5', 'д2', 'оп4', 100),
('о5', 'д5', 'оп5', 500), 
('о5', 'д5', 'оп7', 100),
('о5', 'д6', 'оп2', 200), 
('о5', 'д1', 'оп2', 100),
('о5', 'д3', 'оп4', 200), 
('о5', 'д4', 'оп4', 800),
('о5', 'д5', 'оп4', 400), 
('о5', 'д6', 'оп4', 500);